[
    {
        "status": "Live",
        "type": "Improvements",
        "content": "In the New Luau Type Solver, lambdas will have their argument types inferred more precisely when placed inside well typed tables, and will now have their return types inferred in the same manner."
    },
    {
        "status": "Live",
        "type": "Improvements",
        "content": "In the new Luau type solver, fix an instance where refining a variable with the type `any` would cause it to become `unknown` instead."
    },
    {
        "status": "Live",
        "type": "Improvements",
        "content": "In Luau's New Type Solver, improve the wording of error messages in non-strict mode."
    },
    {
        "status": "Live",
        "type": "Improvements",
        "content": "The MicroProfiler's bottom-right line graph is now synchronized with the main profiler view. Your selected frame range is now highlighted in green on this graph, and you can left-click anywhere on it to instantly re-center the main profiler to that specific frame, making it much faster to find and inspect performance spikes."
    },
    {
        "status": "Live",
        "type": "Improvements",
        "content": "Improves the per-frame performance of `Class.AudioPlayer` while `IsPlaying` is true."
    },
    {
        "status": "Pending",
        "type": "Improvements",
        "content": "In the new Luau type solver, resolve more instances of type checking becoming unresponsive."
    },
    {
        "status": "Pending",
        "type": "Improvements",
        "content": "The view selector has been updated, and may be toggled independently of the camera speed slider."
    },
    {
        "status": "Live",
        "type": "Fixes",
        "content": "Fixes `Enum.ScaleType.Fit` scaling past AbsoluteSize bounds on flipped ImageLabels and ImageButtons."
    },
    {
        "status": "Live",
        "type": "Fixes",
        "content": "Fixes an issue where emitter particles would disappear early."
    },
    {
        "status": "Live",
        "type": "Fixes",
        "content": "Implements a \"sleep\" system for `Class.AudioEmitter|AudioEmitters` meaning that they use no CPU time when all of their inputs are silent."
    },
    {
        "status": "Live",
        "type": "Fixes",
        "content": "Fix an issue that when inspecting the gui/fontdata memory category in the developer console, the client would crash."
    },
    {
        "status": "Live",
        "type": "Fixes",
        "content": "Fix an issue that UIScale does not correctly scale the border stroke offset."
    },
    {
        "status": "Live",
        "type": "Fixes",
        "content": "Watch expressions are no longer cleared on place save."
    },
    {
        "status": "Live",
        "type": "Fixes",
        "content": "Fixes an issue where the drag events would receive the wrong position vector when `Class.ScreenGui.IgnoreGuiInset` is false."
    },
    {
        "status": "Pending",
        "type": "Fixes",
        "content": "`Class.BillboardGui` `CurrentDistance` and `DistanceStep` are now properly implemented according to the documentation.  Properties `DistanceLowerLimit` and `DistanceUpperLimit` will now be officially deprecated."
    },
    {
        "status": "Pending",
        "type": "Fixes",
        "content": "Fixes an issue where Studio can hang when selecting a UI element inside a `Class.UITableLayout` with multiple `Class.UISizeConstraint` child elements."
    },
    {
        "status": "Pending",
        "type": "Fixes",
        "content": "Fixes an issue where the hardware mic indicator remained turned on despite the mic being muted."
    },
    {
        "status": "Pending",
        "type": "Fixes",
        "content": "Fixed an issue that caused MicroProfiler to capture too few frames."
    },
    {
        "status": "Pending",
        "type": "Fixes",
        "content": "Fixes image upload within Material Manager for group experiences."
    }
]