[
    {
        "status": "Live",
        "type": "Improvements",
        "content": "In many cases, we were previously enforcing that concat operands be only strings, and have updated the type solver to accept numbers in those cases as well."
    },
    {
        "status": "Live",
        "type": "Improvements",
        "content": "For the Luau New Type Solver, fixed some instances of being unable to use table literals in a \"more general\" manner."
    },
    {
        "status": "Live",
        "type": "Improvements",
        "content": "Editable mesh updates:\n<ul>\n<li>Add get methods for a vertex on a face. <code>GetVertexFaceColor</code>, <code>GetVertexFaceNormal</code>, <code>GetVertexFaceUV</code></li>\n<li>Add set methods for a vertex on a face. <code>SetVertexFaceColor</code>, <code>SetVertexFaceNormal</code>, <code>SetVertexFaceUV</code></li>\n<li>Add get methods for all corners involving a vertex. <code>GetVertexColors</code>, <code>GetVertexNormals</code>, <code>GetVertexUVs</code>, <code>GetVertexFaces</code></li>\n<li>Deprecate <code>GetVerticesWithAttribute</code> in favor of new alternatives. <code>GetVerticesWithColor</code>, <code>GetVerticesWithNormal</code>, <code>GetVerticesWithUV</code>, <code>GetFaceVertices</code></li>\n<li>Deprecate <code>GetFacesWithAttribute</code> in favor of new alternatives. <code>GetFacesWithColor</code>, <code>GetFacesWithNormal</code>, <code>GetFacesWithUV</code>, <code>GetVertexFaces</code></li>\n</ul>"
    },
    {
        "status": "Live",
        "type": "Improvements",
        "content": "Introduces support for deprecating methods in Luau class declarations."
    },
    {
        "status": "Live",
        "type": "Improvements",
        "content": "Adds a property to <code>Class.VoiceChatService|VoiceChatService</code> that sets the default distance attenuation curve for default voice emitters."
    },
    {
        "status": "Live",
        "type": "Improvements",
        "content": "When using Luau user-defined type functions in Luau's New Type Solver, autocomplete now works on the types coming from evaluation of those type functions."
    },
    {
        "status": "Live",
        "type": "Improvements",
        "content": "Adds an 'Ask Assistant' option to the right-click menu of script errors in the output window."
    },
    {
        "status": "Live",
        "type": "Improvements",
        "content": "In the new Explorer, added box select."
    },
    {
        "status": "Live",
        "type": "Improvements",
        "content": "In the new Explorer, removed \"select on insertion\" setting from dropdown (but is still accessible from the Insert Object settings menu). \"Highlight hierarchy under selection\" has been removed and is now forced on."
    },
    {
        "status": "Pending",
        "type": "Improvements",
        "content": "Removes lighting calculations from rendering."
    },
    {
        "status": "Pending",
        "type": "Improvements",
        "content": "Improves the performance of the IK tool for \"Body Part\" mode in the Animation Clip Editor."
    },
    {
        "status": "Pending",
        "type": "Improvements",
        "content": "Sandboxing is now available for ModuleScripts."
    },
    {
        "status": "Pending",
        "type": "Improvements",
        "content": "Logs an error if users access API's are deemed to not be AuroraScript safe."
    },
    {
        "status": "Live",
        "type": "Fixes",
        "content": "Fixes issues of Luau user-defined type functions failing with 'Type function instance is uninhabited' error when used inside type aliases like <code>type Wrap<T> = { a: UserFunction<T?> }</code> and other nested scenarios."
    },
    {
        "status": "Live",
        "type": "Fixes",
        "content": "In Luau's New Type Solver, fixes a bug with type refinements that would sometimes lead to types exploding to include <code>boolean | buffer | class | function | number | string | table | thread</code>."
    },
    {
        "status": "Live",
        "type": "Fixes",
        "content": "In Luau's New Type Solver, overloaded functions with singleton type arguments now more often infer the correct argument types without casting."
    },
    {
        "status": "Live",
        "type": "Fixes",
        "content": "Fixes an issue that sometimes caused sounds shorter than one frame not to play."
    },
    {
        "status": "Live",
        "type": "Fixes",
        "content": "Fixes the issue with math operations broken in Properties widget."
    },
    {
        "status": "Live",
        "type": "Fixes",
        "content": "DragDetector callbacks may change the Anchored property of the dragged part without fear of crashing."
    },
    {
        "status": "Live",
        "type": "Fixes",
        "content": "Fixes crash that could occur on startup if client settings failed to download."
    },
    {
        "status": "Pending",
        "type": "Fixes",
        "content": "Fixes an animation bug where running IK Control with either the End Effector or Chain Root wrapping a PoseHandle would cause a crash"
    },
    {
        "status": "Pending",
        "type": "Fixes",
        "content": "Fixes an issue that could cause Model LOD to flicker when characters get out of a seat."
    },
    {
        "status": "Pending",
        "type": "Fixes",
        "content": "Fixes a bug in Luau where writing a union of string literal types as a table indexer would cause an unnecessary parse error without being parenthesized."
    },
    {
        "status": "Pending",
        "type": "Fixes",
        "content": "Fixes an issue where inserting from a file into locations other than Workspace would be ignored by undo history."
    },
    {
        "status": "Pending",
        "type": "Fixes",
        "content": "Changes to the ShowDevelopmentGui property are now excluded from change history."
    },
    {
        "status": "Pending",
        "type": "Fixes",
        "content": "Fixes a rare crash relating to the insert object action (Ctrl+I)."
    },
    {
        "status": "Pending",
        "type": "Fixes",
        "content": "Fixes a bug where Studio shortcuts would become disabled after stopping a play test with a text input UI having focus."
    }
]