[
    {
        "status": "Live",
        "type": "Improvements",
        "content": "Renamed TestService.Is30FpsThrottleEnabled to TestService.ThrottlePhysicsToRealtime"
    },
    {
        "status": "Live",
        "type": "Improvements",
        "content": "Adds <code>Class.AudioEmitter:GetAudibilityFor()</code> and <code>Class.AudioListener:GetAudibilityFor()</code>."
    },
    {
        "status": "Live",
        "type": "Improvements",
        "content": "Now when event re-entrancy limits are hit, the script path will be printed."
    },
    {
        "status": "Live",
        "type": "Improvements",
        "content": "Implements <code>AudioChannelMixer</code> and <code>AudioChannelSplitter</code> instances which can be used for channel layout conversions."
    },
    {
        "status": "Live",
        "type": "Improvements",
        "content": "Implements <code>:GetInputPins()</code> and <code>:GetOutputPins()</code> methods on all of the \"Wirable\"/Audio API instances. These list options are available for <code>Wire.TargetName</code> and <code>Wire.SourceName</code> respectively."
    },
    {
        "status": "Live",
        "type": "Improvements",
        "content": "Moves the Insert Object button back next to the Instance name under the Next Gen Explorer beta."
    },
    {
        "status": "Pending",
        "type": "Improvements",
        "content": "Fixes a bug with sky and lighting initialization."
    },
    {
        "status": "Pending",
        "type": "Improvements",
        "content": "WrapDeformer:SetCageMeshContent() now takes an optional CFrame second parameter for the CageOrigin. If you set the cage to a mesh from another BaseWrap (or EditableMesh derived from a BaseWrap mesh), set this parameter so the deformer cage properly lines up with its parent mesh."
    },
    {
        "status": "Pending",
        "type": "Improvements",
        "content": "In the New Type Solver Beta, implements <code>getmetatable</code> and <code>setmetatable</code> type functions to enable Creators to more readily work with metatable types without the use of <code>typeof</code>."
    },
    {
        "status": "Live",
        "type": "Fixes",
        "content": "Existing UGC characters no longer retarget animations, but new UGC characters support retargeting."
    },
    {
        "status": "Live",
        "type": "Fixes",
        "content": "Deprecates the <code>Class.AudioPlayer.AssetId</code> property, which was a string, and replaces it with <code>AudioPlayer.Asset</code>, which is of type <code>Content</code>. This autocompletes <code>rbxassetid://</code> in studio when typing numbers into the text box."
    },
    {
        "status": "Live",
        "type": "Fixes",
        "content": "Fixes a <code>require-by-string</code> issue where <code>require</code> calls inside closures resolve relative to an incorrect Instance."
    },
    {
        "status": "Live",
        "type": "Fixes",
        "content": "Removes invalid unicode handling for characters in error logs on Windows."
    },
    {
        "status": "Live",
        "type": "Fixes",
        "content": "Memory profiler now shows separate items for terrain textures vs. terrain meshes under GPU memory. Previously this was counted together."
    },
    {
        "status": "Pending",
        "type": "Fixes",
        "content": "Improves script paths in the Luau error message call stack section in cases where scripts are cloned/moved in the DataModel."
    },
    {
        "status": "Pending",
        "type": "Fixes",
        "content": "Fixes a bug in Luau's type system where extending tables copied with <code>table.clone</code> would cause the types of both tables to be inaccurately combined."
    },
    {
        "status": "Pending",
        "type": "Fixes",
        "content": "Fixes bugs for the Luau new solver beta where some type functions are \"uninhabited\" and look like: <code>t1 where t1 = union<A, union<B, t1>></code>"
    },
    {
        "status": "Pending",
        "type": "Fixes",
        "content": "Fixes an issue causing <code>Class.Sound.DidLoop</code> to sometimes trigger more than once after a loop."
    },
    {
        "status": "Pending",
        "type": "Fixes",
        "content": "In the New Type Solver Beta, resolves a bug where recursive types would sometimes cause type normalization to loop infinitely until memory was exhausted."
    },
    {
        "status": "Pending",
        "type": "Fixes",
        "content": "TextChatService's default UI longer does unnecessary work in the background when disabled, either through <code>StarterGui:SetCoreGuiEnabled</code> or <code>ChatWindowConfiguration.Enabled</code>. This eliminates redundant work for experiences with custom chat UI."
    }
]