[
    {
        "status": "Live",
        "type": "Improvements",
        "content": "Fixed an issue where `Instance.Clone` failed with a security capability error when performed inside `Instance.Sandboxed` containers."
    },
    {
        "status": "Live",
        "type": "Improvements",
        "content": "Fixes issue where `Enum.Material.ForceField` outlines from backface don't appear on desktop and console."
    },
    {
        "status": "Live",
        "type": "Improvements",
        "content": "Adds a \"Custom\" option for particle flipbook layouts, allowing you to define custom numbers of columns and rows."
    },
    {
        "status": "Live",
        "type": "Improvements",
        "content": "Allows 255 highlights in one scene."
    },
    {
        "status": "Live",
        "type": "Improvements",
        "content": "In Luau's New Type Solver, fix some instances where refinements would cause function calls to report a false positive type error."
    },
    {
        "status": "Live",
        "type": "Improvements",
        "content": "In the New Luau Type solver, resolve a regression where passing a string literal to a function accepting a generic and a string singleton would not force said literal to be a singleton type."
    },
    {
        "status": "Live",
        "type": "Improvements",
        "content": "MicroProfiler counters now display a breakdown of Luau Heap memory use of each DataModel and VM group. Additionally, execution time of each VM will be displayed. 'lua/heap' group has been split into 'Luau/heap' and 'Luau/heap_core' to exclude plugin and core script memory use from the existing memory category."
    },
    {
        "status": "Live",
        "type": "Improvements",
        "content": "Errors that are thrown before Luau thread was able to start like 'C stack overflow', 'Not running script because past shutdown deadline' and others will now include information about the call target."
    },
    {
        "status": "Live",
        "type": "Improvements",
        "content": "Script error tooltip will now display information about all errors at that location instead of showing only the first one."
    },
    {
        "status": "Live",
        "type": "Improvements",
        "content": "If Luau native code generation is not available on the device, only a single error message will be reported."
    },
    {
        "status": "Live",
        "type": "Improvements",
        "content": "Update the styling of toast notifications in Studio to align with the Next Gen Studio Preview beta's styling."
    },
    {
        "status": "Pending",
        "type": "Improvements",
        "content": "Adds `vector.lerp()` to the standard Luau library."
    },
    {
        "status": "Pending",
        "type": "Improvements",
        "content": "Adjust script analysis warnings and type hover from Luau to refer to the top type of foreign function types (e.g. from the Roblox API) as `userdata`."
    },
    {
        "status": "Live",
        "type": "Fixes",
        "content": "Fixes an issue where scroll bar transparency changes were ignored when the `Class.ScrollingFrame` was not interactable."
    },
    {
        "status": "Live",
        "type": "Fixes",
        "content": "Fixes a potential infinite loop when re-capturing focus on the same text box."
    },
    {
        "status": "Live",
        "type": "Fixes",
        "content": "`Instance.Sandboxed` property can once again be set on the `Class.Workspace`."
    },
    {
        "status": "Live",
        "type": "Fixes",
        "content": "Fixes an issue where sounds with `Class.Sound.PlayOnRemove` enabled can play unmuted after leaving an experience."
    },
    {
        "status": "Live",
        "type": "Fixes",
        "content": "Fixes an issue with multiple replication foci that can prevent stream out of regions in some situations."
    },
    {
        "status": "Live",
        "type": "Fixes",
        "content": "In Luau's New Type Solver, fix some instances where autocomplete/script analysis would fail to ever appear, and Studio would hang on closing."
    },
    {
        "status": "Live",
        "type": "Fixes",
        "content": "Fixes an issue where the Acoustic Simulation beta feature can slow down physics updates, leading to worse framerates."
    },
    {
        "status": "Live",
        "type": "Fixes",
        "content": "Fixes an issue with the Acoustic Simulation beta feature where rapidly creating `Class.AudioEmitter|AudioEmitters` or `Class.AudioListener|AudioListeners` can cause frametime spikes"
    },
    {
        "status": "Live",
        "type": "Fixes",
        "content": "Rather than deactivating itself, the UI Editor now clears the selection but remains activated when clicking over empty space in viewport, allowing subsequent GUI object selections.\n\nSelecting non-GUI objects or clearing the selection through other means than the UI Editor will still cause it to deactivate."
    },
    {
        "status": "Pending",
        "type": "Fixes",
        "content": "Fixes an issue where zoom level gets reset in vehicles and VR cameras upon `Class.UserInputService.PreferredInput` changing."
    },
    {
        "status": "Pending",
        "type": "Fixes",
        "content": "MicroProfiler: When the on-screen UI is switched to Hidden mode, clicks now pass through it as expected."
    }
]