[
    {
        "status": "Live",
        "type": "Improvements",
        "content": "Luau's New Type Solver: Overload resolution is now slightly more principled during type inference. Previously would attempt to unify arguments with all of the possible overloads, which would often select an overload at random."
    },
    {
        "status": "Live",
        "type": "Improvements",
        "content": "Adds support to Luau for instantiating generic type parameters on functions by writing syntax like `f<<T, U>>`.\n\nFor example, if you have defined a function like:\n\n```\nlocal function array<T>(): {T}\nreturn {}\nend\n```\n\nYou can now call it with a specific type by calling `array<<number>>()` to get a result of the type `{number}`."
    },
    {
        "status": "Live",
        "type": "Improvements",
        "content": "Removes clipping/distortion from `Class.AudioListener` when `Class.AudioEmitter|AudioEmitters` are not creating feedback loops."
    },
    {
        "status": "Live",
        "type": "Improvements",
        "content": "Luau autocomplete will now show string singleton keys when indexing into tables with a name expression, as in `A.B`"
    },
    {
        "status": "Live",
        "type": "Improvements",
        "content": "Luau's New Type Solver: Updates the behavior of type functions to not signal an irreducible error when there's already a more specific error from the type function."
    },
    {
        "status": "Live",
        "type": "Improvements",
        "content": "`string.char` and `string.sub` function calls can now be optimized to a string constant if the arguments are constants."
    },
    {
        "status": "Live",
        "type": "Improvements",
        "content": "Luau compiler will inline function calls with constant arguments more often if those constants considerably simplify the called method body (cause branches to be removed)."
    },
    {
        "status": "Live",
        "type": "Improvements",
        "content": "Luau's New Type Solver: Improves error message associated with indexing into a union where a member is not a table."
    },
    {
        "status": "Live",
        "type": "Improvements",
        "content": "Luau's New Type Solver: Resolves a potential crash when using type instantiation expressions."
    },
    {
        "status": "Live",
        "type": "Improvements",
        "content": "Deprecates nearly all yielding methods that did not end with `Async` and provides equivalent methods with `Async` in the name."
    },
    {
        "status": "Pending",
        "type": "Improvements",
        "content": "Improves performance by lowering the cost of `updateInstancedCluster2` when using SLIM."
    },
    {
        "status": "Pending",
        "type": "Improvements",
        "content": "Introduces three-phase rollout for fixed simulation frequency."
    },
    {
        "status": "Pending",
        "type": "Improvements",
        "content": "Luau's New Type Solver: Indexing into a table with an indexer who's keys are string singletons will now infer the indexer result type."
    },
    {
        "status": "Pending",
        "type": "Improvements",
        "content": "Optimizes the animation system for large articulated rigs."
    },
    {
        "status": "Live",
        "type": "Fixes",
        "content": "Fixes a bug where players would push each other off moving platforms even when their collision groups are set not to collide."
    },
    {
        "status": "Live",
        "type": "Fixes",
        "content": "Fixes false culling for some skinned meshes."
    },
    {
        "status": "Pending",
        "type": "Fixes",
        "content": "Fixes flakiness in `AudioSpeechToText` instantiation."
    },
    {
        "status": "Pending",
        "type": "Fixes",
        "content": "Fixes staggered particle emission in continuous particle streams."
    },
    {
        "status": "Pending",
        "type": "Fixes",
        "content": "Fixes Smoothing Angle not functioning in Studio."
    },
    {
        "status": "Pending",
        "type": "Fixes",
        "content": "Luau's New Type Solver: refinements against types no longer cause spurious errors in nonstrict mode, such as being unable to pass a refined `string` to string library methods"
    },
    {
        "status": "Pending",
        "type": "Fixes",
        "content": "Fixes an issue where text in Microprofiler and performance windows could take a long time to appear."
    },
    {
        "status": "Pending",
        "type": "Fixes",
        "content": "Emissive maps beta: Fixes a crash when importing a 3D model with missing files or broken content."
    },
    {
        "status": "Pending",
        "type": "Fixes",
        "content": "Luau's New Type Solver: Fixes hangs that could occur when trying to infer exceptionally large intersection types."
    },
    {
        "status": "Pending",
        "type": "Fixes",
        "content": "Fixes an issue that allowed players to send messages with excessive amounts of whitespace."
    }
]