[
    {
        "status": "Live",
        "type": "Improvements",
        "content": "Fixes some issues with assigning tables in Luau’s New Type Solver where optional fields were mistakenly required."
    },
    {
        "status": "Pending",
        "type": "Improvements",
        "content": "Adds a field to <code>Class.DataModel</code> called <code>MatchmakingType</code> and a corresponding enum with the following values: <code>Default</code>, <code>XboxOnly</code>, and <code>PlayStationOnly</code>."
    },
    {
        "status": "Pending",
        "type": "Improvements",
        "content": "When you set a custom icon theme, <code>StudioService:GetClassIcon()</code> now returns your custom icons within the New Explorer Beta."
    },
    {
        "status": "Pending",
        "type": "Improvements",
        "content": "Overhauls the handling of scrolling in the Roblox engine so that scroll deltas are no longer always integers."
    },
    {
        "status": "Pending",
        "type": "Improvements",
        "content": "Adds the Lock button and Anchor tool button to the new Ribbon in Next Gen Studio Preview."
    },
    {
        "status": "Live",
        "type": "Fixes",
        "content": "Fixes a bug where an animation assetID would sometimes overlap the copy button in the post-publish pop-up window."
    },
    {
        "status": "Live",
        "type": "Fixes",
        "content": "Luau require expressions now support arguments containing () or typeof type annotations containing a resolvable instance path."
    },
    {
        "status": "Live",
        "type": "Fixes",
        "content": "Fixes a Next Gen Studio Preview bug where the command bar would hide when opening a script."
    },
    {
        "status": "Pending",
        "type": "Fixes",
        "content": "<code>Class.WrapDeformer</code> now respects its <code>Class.WrapDeformer.CageOrigin|CageOrigin</code> property rather than using the position of its sibling <code>Class.WrapTarget</code>."
    },
    {
        "status": "Pending",
        "type": "Fixes",
        "content": "Fixes a crash that would occur when an avatar rig contained legacy clothing alongside layered clothing without a <code>Class.SurfaceAppearance</code> object."
    },
    {
        "status": "Pending",
        "type": "Fixes",
        "content": "Fixes bug where parts of the rig in the IK chain of <code>Class.IKControl</code> have incorrect scale and offset when <code>ScaleTo</code> is called on the model."
    },
    {
        "status": "Pending",
        "type": "Fixes",
        "content": "Fixes a New Explorer Beta bug where inserted services didn't become visible in the Explorer window."
    }
]