[
    {
        "status": "Live",
        "type": "Improvements",
        "content": "Allows developer plugins to trigger the opening of the directional curve editor."
    },
    {
        "status": "Live",
        "type": "Improvements",
        "content": "Improves lighting update performance on mobile devices with PowerVR GPUs."
    },
    {
        "status": "Live",
        "type": "Improvements",
        "content": "Improves performance on some Android devices running on PowerVR GPUs."
    },
    {
        "status": "Live",
        "type": "Improvements",
        "content": "Reduces startup time and memory usage on Windows devices."
    },
    {
        "status": "Live",
        "type": "Improvements",
        "content": "Script Sync and Next Gen Explorer beta features interact properly. Script Sync status and actions are now available in the Next Gen Explorer."
    },
    {
        "status": "Live",
        "type": "Improvements",
        "content": "In a group Team Create session, the owner of the place becomes the owner of any models and assets uploaded through the Avatar Setup Tool."
    },
    {
        "status": "Live",
        "type": "Improvements",
        "content": "Adds support for built-in and custom gear accessories in the Avatar Setup previewer."
    },
    {
        "status": "Pending",
        "type": "Improvements",
        "content": "Adds a new <code>Class.Decal.TextureContent</code> property so that <code>EditableImage</code> can be used with decals."
    },
    {
        "status": "Live",
        "type": "Fixes",
        "content": "Fixes a bug in which playback from <code>Class.VideoFrame</code> doesn’t work under <code>Class.CanvasGroup</code>."
    },
    {
        "status": "Live",
        "type": "Fixes",
        "content": "Improves performance of reading small boxes from Terrain."
    },
    {
        "status": "Live",
        "type": "Fixes",
        "content": "Resolves a bug in the New Type Solver Beta where <code>string.format</code> previously did not respect error-suppressing types like <code>any</code>, leading to false positive type errors."
    },
    {
        "status": "Live",
        "type": "Fixes",
        "content": "Fixes inconsistent behavior where the Explorer behaves as if the cursor is hovering over it when you use keyboard key interactions."
    },
    {
        "status": "Live",
        "type": "Fixes",
        "content": "Fixes an issue where switching themes throws warnings and doesn’t change class icons in the New Explorer Beta."
    },
    {
        "status": "Live",
        "type": "Fixes",
        "content": "Fixes an issue where instances reparent at creation and cause errors in the New Explorer Beta. You no longer get errors when inserting free models."
    },
    {
        "status": "Pending",
        "type": "Fixes",
        "content": "Enables the <code>Class.Workspace.FallHeightEnabled</code> property to toggle the fallen height kill plane. Also fixes the kill plane logic so that models with at least one descendant fallen part or no descendant parts are deleted."
    },
    {
        "status": "Pending",
        "type": "Fixes",
        "content": "Fixes a crash when using the CSG <code>Class.BasePart</code> API with the solid modeling improvements beta enabled."
    }
]