[
    {
        "status": "Live",
        "type": "Improvements",
        "content": "Adds new <code>Enum.AlphaMode|TintMask</code> alpha blend mode for <code>Class.SurfaceAppearance</code>. Additionally, streaming LoD meshes more accurately represent the <code>Class.SurfaceAppearance</code> alpha blend modes."
    },
    {
        "status": "Live",
        "type": "Improvements",
        "content": "Autocomplete and typechecking is now available inside Luau type functions (feature of Luau's New Type Solver)."
    },
    {
        "status": "Live",
        "type": "Improvements",
        "content": "Improved experience join times."
    },
    {
        "status": "Live",
        "type": "Improvements",
        "content": "Enables localized autocomplete documentation. Most documentation will be translated according to the set Studio language. Content that has not yet been translated will continue to show up in English."
    },
    {
        "status": "Pending",
        "type": "Improvements",
        "content": "In Luau's New Type Solver, improves the rendering of type errors to significantly increase comprehension of subtyping failures with multiple underlying reasons."
    },
    {
        "status": "Pending",
        "type": "Improvements",
        "content": "MicroProfiler on-screen UI can be easily closed now."
    },
    {
        "status": "Pending",
        "type": "Improvements",
        "content": "Fixes a bug on consoles where attempting to purchase an item while having enough Robux would cause gamepad selection to stop working in experiences with the virtual cursor disabled."
    },
    {
        "status": "Live",
        "type": "Fixes",
        "content": "Narrows return types for multiple <code>Class.WorldModel</code> APIs from <code>{Instance}</code> to <code>{BasePart}</code>."
    },
    {
        "status": "Live",
        "type": "Fixes",
        "content": "Fixes an issue on PlayStation where logging into the user that launched Roblox on another controller could cause the gamepad disconnect modal to stay on the screen."
    },
    {
        "status": "Live",
        "type": "Fixes",
        "content": "Fixes an issue on console chat where chat tags weren't being rendered correctly due to up-scaled text size."
    },
    {
        "status": "Live",
        "type": "Fixes",
        "content": "Audio discovery plugin now discovers new asset IDs where it previously did not."
    },
    {
        "status": "Live",
        "type": "Fixes",
        "content": "<kbd>Ctrl</kbd><kbd>Z</kbd> (<kbd>⌘</kbd><kbd>Z</kbd>) now performs an undo in text input boxes. Similarly, <kbd>Ctrl</kbd><kbd>Y</kbd> (<kbd>⌘</kbd><kbd>Y</kbd>) or <kbd>Ctrl</kbd><kbd>Shift</kbd><kbd>Z</kbd> (<kbd>⌘</kbd><kbd>Shift</kbd><kbd>Z</kbd>) now performs a redo in text input boxes."
    },
    {
        "status": "Live",
        "type": "Fixes",
        "content": "Holding <code>Alt</code> no longer disables scrolling in Studio for Windows."
    },
    {
        "status": "Live",
        "type": "Fixes",
        "content": "Fixes a bug in the \"Next Gen Explorer\" beta with inconsistent cursor state of hovering when you aren't actually hovering."
    },
    {
        "status": "Pending",
        "type": "Fixes",
        "content": "Terrain APIs now print warnings if the region is not aligned to the voxel grid as per documentation. Please use <code>Datatype.Region3:ExpandToGrid()</code> to make regions aligned, as this will become an error in the future."
    },
    {
        "status": "Pending",
        "type": "Fixes",
        "content": "In Luau's New Type Solver, the <code>index</code> type function now returns the type <code>any</code> when indexing an error-suppressing type."
    },
    {
        "status": "Pending",
        "type": "Fixes",
        "content": "In Luau's New Type Solver, the <code>index</code> type function no longer crashes when looking up a missing property in a cyclic metatable."
    },
    {
        "status": "Pending",
        "type": "Fixes",
        "content": "In Luau's New Type Solver, the <code>index</code> type function now computes the result type of an index when using a metatable with a function as the <code>__index</code> metamethod."
    }
]